## Second Highest Salary Leetcode Task11

In [3]:
import pandas as pd
import numpy as np

In [4]:
data = [[1, 100], [2, 200], [3, 300]]
Employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [5]:
Employee

   id  salary
0   1     100
1   2     200
2   3     300

In [6]:
distinct_salaries = Employee['salary'].drop_duplicates()
distinct_salaries_sorted = distinct_salaries.sort_values(ascending=False)
distinct_salaries_sorted

2    300
1    200
0    100
Name: salary, dtype: int64

In [8]:
second_highest_salary = distinct_salaries_sorted.iloc[1] if 2 <= len(distinct_salaries) else None
second_highest_salary

200

In [10]:
output = pd.DataFrame([[second_highest_salary]], columns=['SecondHighestSalary'])
output

   SecondHighestSalary
0                  200